test_cases/spalart_allmaras/steadyState/0.org/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 6.1348e-5;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    Jet 
    {
        type            fixedValue; 
        value           uniform 0;   
    }

    wallPreInlet
    {
        type            fixedVAlue;
        value           uniform 0;
    }

    upperWall
    {
        type            fixedValue; 
        value           uniform 0;   
    }

    lowerWall
    {
        type            fixedValue; 
        value           uniform 0;  
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
